In [141]:
import pandas as pd
import numpy as np
from word2number import w2n
from sklearn.linear_model import LinearRegression

In [142]:
df = pd.read_csv("salary_data.csv")

In [143]:
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [144]:
df.shape

(8, 4)

In [145]:
df = df.rename(columns={"test_score(out of 10)": "test_score",
                   "interview_score(out of 10)": "interview_score",
                   "salary($)": "salary"})

In [146]:
df.isna().sum()

experience         2
test_score         1
interview_score    0
salary             0
dtype: int64

In [147]:
df.experience = df.experience.fillna('zero')
df.head(10)

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [148]:
df.experience = df.experience.apply(w2n.word_to_num)
df.head(10)

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         NaN                7   72000
7          11         7.0                8   80000

In [149]:
df.isna().sum()

experience         0
test_score         1
interview_score    0
salary             0
dtype: int64

In [150]:
df['test_score'] = df['test_score'].fillna(df['test_score'].median())
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

In [151]:
df1 = df.drop(['salary'], axis=1)
df1

   experience  test_score  interview_score
0           0         8.0                9
1           0         8.0                6
2           5         6.0                7
3           2        10.0               10
4           7         9.0                6
5           3         7.0               10
6          10         8.0                7
7          11         7.0                8

In [152]:
reg = LinearRegression()
reg.fit(df1.values, df['salary'])

LinearRegression()

In [153]:
reg.predict([[10, 6, 6]])

array([70172.48908297])

In [154]:
reg.predict([[0, 10, 10]])

array([58246.72489083])